notes/sept13/sept13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-14 Thu 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducing untyped λ-calculus</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Introducing untyped λ-calculus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga7e053d">1. Review</a>
<ul>
<li><a href="#org0b83f3b">1.1. Definition</a></li>
<li><a href="#orga4ec88a">1.2. Free and bound variables</a></li>
<li><a href="#orgcab7a09">1.3. Substitution</a></li>
<li><a href="#org3b549b2">1.4. Relations on λ-terms</a></li>
<li><a href="#orgf02d09b">1.5. Extending relations</a></li>
<li><a href="#org64f8d23">1.6. Normal forms</a></li>
</ul>
</li>
<li><a href="#orgdefacb8">2. Exercises</a>
<ul>
<li><a href="#org89a355b">2.1. Part 1</a></li>
<li><a href="#org274e195">2.2. Part 2</a></li>
<li><a href="#org0de984a">2.3. Part 3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga7e053d" class="outline-2">
<h2 id="orga7e053d"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
<p>
We will now start to talk about untyped λ-calculus as a precursor to
λ-calculus with types. Before using it for anything, we will need to define
it, including the relations on terms β, η, and α.
\[\def\IF#1{[\hspace{-0.8mm}[#1]\hspace{-0.8mm}]}\]
\[\def\divd{\ |\ }\]
\[\def\Coloneqq{::=}\]
</p>
</div>

<div id="outline-container-org0b83f3b" class="outline-3">
<h3 id="org0b83f3b"><span class="section-number-3">1.1.</span> Definition</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To define the λ-calculus, we need an infinite set \(\mathcal{V}\) of
variables. We can assume that these are denumerably infinite, i.e., in a
one-to-one correspondence with the natural numbers. Given such a set, we may
define the set Λ of untyped λ-terms as the smallest set meeting the following
constraints:
</p>
<ul class="org-ul">
<li>If \(x ∈ \mathcal{V}\), then \(x ∈ Λ\). \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\) (Variables)</li>
<li>If \(M, N ∈ Λ\), then \((M\,N) ∈ Λ\). \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\)  (Applications)</li>
<li>If \(M ∈ Λ\) and \(x ∈ \mathcal{V}\), then \((λx.M) ∈ Λ\). \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\)  (Abstractions)</li>
</ul>
<p>
This definition can be expressed more succinctly in Backus-Naur form, as:
\[M, N \Coloneqq x \divd (M\,N) \divd (λx.M)\]
</p>

<p>
Let us also introduce a few notational conventions. We will leave parentheses
off λ-terms when doing so does not generate ambiguity. As a convention, we
will assume that applications associate to the left:
\[M\,N\,O\ ≝\ ((M\,N)\,O)\]
We will also assume that application has a higher precedence than
abstraction:
\[λx.M\, N\ ≝\ (λx.(M\,N))\]
Finally, when we have a sequence of abstractions it is nice to write them
with the binder occurrences of variables separated by commas:
\[λx, y, ...,z.M\ ≝\ (λx.(λy.(...(λz.M)...)))\]
</p>
</div>
</div>

<div id="outline-container-orga4ec88a" class="outline-3">
<h3 id="orga4ec88a"><span class="section-number-3">1.2.</span> Free and bound variables</h3>
<div class="outline-text-3" id="text-1-2">
<p>
An important distinction relevant to the <i>meaning</i> of λ-terms is that between
variables which are free and variables which are bound. This distinction will
determine whether or not a variable with a given name inside of a λ-term is
bound in that term, and, hence, whether or not it can be substituted. To
illustrate, take the term
\[(λx.(λx.x))\]
Here, we want the embedded term \((λx.x)\) to encode the identity function
regardless of the context in which it occurs. Thus the variable \(x\) which
occurs in the body of this term will be considered to be bound there by the
`\(λx\)'. We can encode this understanding of λ-terms in terms of the following
definition of free variables via the function \(fv : Λ → 2^\mathcal{V}\):
\[fv(x) = \{x\}\]
\[fv(M\,N) = fv(M) ∪ fv(N)\]
\[fv(λx.M) = fv(M) - \{x\}\]
As we see, a variable is no longer free in the scope of the closest matching
binder for that variable.
</p>
</div>
</div>

<div id="outline-container-orgcab7a09" class="outline-3">
<h3 id="orgcab7a09"><span class="section-number-3">1.3.</span> Substitution</h3>
<div class="outline-text-3" id="text-1-3">
<p>
We now define the notion of substitution on λ-terms; we write \(M[x≔N]\) to
denote the result of substituting the λ-term \(N\) for free occurrences of the
variable \(x\) inside the λ-term \(M\). (That is, we are defining a function
\((·)[x≔N] : Λ → Λ\) which takes any λ-term \(M\) onto the λ-term just like \(M\),
but with \(N\) substituted for all of its free occurrences of \(x\).)
</p>
<ul class="org-ul">
<li>\(x[x≔N] ≝ N\)</li>
<li>\(y[x≔N] ≝ y\) \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\) (when \(y≠x\))</li>
<li>\((M\,N)[x≔O] ≝ (M[x≔O]\,N[x≔O])\)</li>
<li>\((λx.M)[x≔N] ≝ (λx.M)\)</li>
<li>\((λy.M)[x≔N] ≝ (λy.M[x≔N])\) \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\) (when \(y≠x\) and \(y ∉ fv(N)\))</li>
<li>\((λy.M)[x≔N] ≝ (λz.M[y≔z][x≔N])\) <br />
(when \(y≠x\) and \(z ∉ fv(M) ∪ fv(N)\), i.e., \(z\) is fresh for
\(M\) and \(N\))</li>
</ul>
</div>
</div>

<div id="outline-container-org3b549b2" class="outline-3">
<h3 id="org3b549b2"><span class="section-number-3">1.4.</span> Relations on λ-terms</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The relation of β-conversion provides the meaning of the application of a
function to an argument. It is defined as follows:
</p>
<ul class="org-ul">
<li>\((λx.M)\,N\ ▹_β\ M[x≔N]\)</li>
</ul>

<p>
The relation of η-conversion is defined as follows:
</p>
<ul class="org-ul">
<li>\(λx.M\,x\ ▹_η\ M\) \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\) (when \(x ∉ fv(M)\))</li>
</ul>
<p>
η provides a kind of functional extensionality for λ-terms. That is, assuming
it has the result that λ-terms are equivalent (inter-reducible) when they
compute the same function.
</p>

<p>
Finally, α-conversion is defined as follows:
</p>
<ul class="org-ul">
<li>\(λx.M\ ▹_α λy.M[x≔y]\) \(\mbox{}\,\,\,\,\,\,\,\,\,\,\,\mbox{}\) (when \(y ∉ fv(M)\))</li>
</ul>
<p>
α-conversion is just the renaming of bound variables. 
</p>
</div>
</div>

<div id="outline-container-orgf02d09b" class="outline-3">
<h3 id="orgf02d09b"><span class="section-number-3">1.5.</span> Extending relations</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Given a relation \(R ∈ \{α, β, η\}\), its compatible closure \(→_R\) is the
relation gotten by extending \(R\) to apply to sub-parts of λ-terms. More
precisely, \(→_R\) is the least relation such that:
</p>
<ol class="org-ol">
<li>\(R ⊆ →_R\)</li>
<li>If \(M →_R\,N\), then \(M\,O →_R N\,O\)</li>
<li>If \(O →_R\,N\), then \(M\,O →_R M\,N\)</li>
<li>If \(M →_R\,N\), then \(λx.M →_R λx.N\)</li>
</ol>
<p>
This allows us to apply (one-step) α-, β-, or η-conversion anywhere inside a
λ-term.
</p>

<p>
Next, it is useful to have the reflexive transitive closure of a relation
\(R\). Given \(R ⊆ Λ × Λ\), its reflexive transitive closure \(R^*\) is the least
relation such that:
</p>
<ol class="org-ol">
<li>\(R ⊆ R^*\)</li>
<li>\(⟨M, M⟩ ∈ R^*\) for every \(M ∈ Λ\)</li>
<li>If \(⟨M, N⟩ ∈ R^*\) and \(⟨N, O⟩ ∈ R^*\), then \(⟨M, O⟩ ∈ R^*\)</li>
</ol>
<p>
It will be useful to have \(→_α^*\), \(→_β^*\), and \(→_η^*\), in order to do α-,
β-, and η-conversion while bypassing any number of intermediate reductions.
</p>

<p>
We will also sometimes refer to the reflexive symmetric transitive closure of
a relation \(R\). This extension \(≡_R\) is defined just like \(→_R^*\), except
that there is also a condition of symmetry:
</p>
<ul class="org-ul">
<li>If \(M ≡_R N\), then \(N ≡_R M\)</li>
</ul>
<p>
That is, \(≡_R\) is the least equivalence relation respecting \(R\). When we talk
about two terms \(M\) and \(N\) as being ``α-, β-, η-equivalent'', it will mean
that they satisfy \(M ≡_{α/β/η} N\). 
</p>
</div>
</div>

<div id="outline-container-org64f8d23" class="outline-3">
<h3 id="org64f8d23"><span class="section-number-3">1.6.</span> Normal forms</h3>
<div class="outline-text-3" id="text-1-6">
<p>
A λ-term is in \(R\) normal form if it does not have any \(R\) redices; that is,
sub-terms to which the relation \(R\) may be applied. \(R\) here may be β, η, or
βη (\(≝ β ∪ η\)). We will speak of a λ-term \(M\) as having an \(R\) normal form
(or just a normal form, when the context is clear) if there is some λ-term
\(N\) in \(R\) normal form, and \(M →_R^* N\).
</p>

<p>
Does every λ-term have a β normal form? No. For example:
\[(λx.x\,x)\,(λx.x\,x)\]
is not in normal form and, moreover, it β-reduces to itself.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdefacb8" class="outline-2">
<h2 id="orgdefacb8"><span class="section-number-2">2.</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org89a355b" class="outline-3">
<h3 id="org89a355b"><span class="section-number-3">2.1.</span> Part 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Prove that \((λx.M\,x) N →_β M\,N\) whenever \(x ∉ FV(M)\).
</p>
</div>
</div>

<div id="outline-container-org274e195" class="outline-3">
<h3 id="org274e195"><span class="section-number-3">2.2.</span> Part 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
β-reduce the following term as much as possible:
\[(λx.x\,(λz.z\,y))\,(λz, y.z\,y)\]
</p>
</div>
</div>

<div id="outline-container-org0de984a" class="outline-3">
<h3 id="org0de984a"><span class="section-number-3">2.3.</span> Part 3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Let \(M\), \(N\), and \(L\) be λ-terms, and let \(x\) and \(y\) be variables such that
\(x ≠ y\) and \(x ∉ FV(L)\). Prove that first substituting \(N\) for \(x\) in \(M\) and
then substituting \(L\) for \(y\) in the result is the same as substituting \(L\)
for \(y\) in \(M\) and then substituting the result of substituting \(L\) for \(y\)
in \(N\) for \(x\) in \(M\). That is, show the following:
\[M[x≔N][y≔L] = M[y≔L][x≔N[y≔L]]\]
Hint: show this inductively. The proof would be analogous to the answer to
Part 5 of the `Formal preliminaries' exercises (note that there is an answer
key on Zulip).
In particular, first show that this statement is true of variables. Then,
show that, given that it is true for arbitrary λ-terms \(M_1\) and \(M_2\), it is
also true of the λ-term \((M_1\,M_2)\), as well as the λ-term \((λx.M_1)\) (for
\(x ∈ \mathcal{V}\)).
</p>

<p>
Why does such a proof show what we want?
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-09-14 Thu 15:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>